Thomas, thanks for sticking with me and for looking at it that closely. There really is a difference between `metrics` and `monitor` SLOs.

I've re-done my testing with both types. I've `destroyed` everything, starting with a clean slate.

Here's the `plan`:
```
  # datadog_service_level_objective.my-metric-slo will be created
  + resource "datadog_service_level_objective" "my-metric-slo" {
      + id             = (known after apply)
      + monitor_search = (known after apply)
      + name           = "my-metric-slo"
      + type           = "metric"

      + query {
          + denominator = "..."
          + numerator   = "..."
        }

      + thresholds {
          + target    = 87.654
          + timeframe = "7d"
          + warning   = 98.765
        }
      + thresholds {
          + target    = 76.543
          + timeframe = "30d"
          + warning   = 87.654
        }
      + thresholds {
          + target    = 65.432
          + timeframe = "90d"
          + warning   = 76.543
        }
    }

  # datadog_service_level_objective.my-monitor-slo will be created
  + resource "datadog_service_level_objective" "my-monitor-slo" {
      + id             = (known after apply)
      + monitor_ids    = (known after apply)
      + monitor_search = (known after apply)
      + name           = "my-monitor-slo"
      + type           = "monitor"

      + thresholds {
          + target    = 87.654
          + timeframe = "7d"
          + warning   = 98.765
        }
      + thresholds {
          + target    = 76.543
          + timeframe = "30d"
          + warning   = 87.654
        }
      + thresholds {
          + target    = 65.432
          + timeframe = "90d"
          + warning   = 76.543
        }
    }
```

I `apply`-ed that plan, followed by another `plan`:
```
  # datadog_service_level_objective.my-monitor-slo will be updated in-place
  ~ resource "datadog_service_level_objective" "my-monitor-slo" {
        groups      = []
        id          = "a6e93e5ee78d59e6b741596641693d72"
        monitor_ids = [
            27461566,
        ]
        name        = "my-monitor-slo"
        tags        = []
        type        = "monitor"

      ~ thresholds {
          ~ target          = 87.65 -> 87.654
            target_display  = "87.65"
            timeframe       = "7d"
          ~ warning         = 98.76 -> 98.765
            warning_display = "98.76"
        }
      ~ thresholds {
          ~ target          = 76.54 -> 76.543
            target_display  = "76.54"
            timeframe       = "30d"
          ~ warning         = 87.65 -> 87.654
            warning_display = "87.65"
        }
        thresholds {
            target          = 65.432
            target_display  = "65.432"
            timeframe       = "90d"
            warning         = 76.543
            warning_display = "76.543"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
Seems really like the `target|warning` are being truncated for `monitor` SLOs but not for `metric` SLOs. 

So many questions:
1. What's the motivation behind that? 
2. Where's that documented? If it isn't, could it get documented?
3. Could there be a warning about this? Or even an error? No point in me expecting a more precise `target|warning` if it isn't honored anyway.